package com.android.blog.company;

class Main {

    /**
     * dev:
     * 1. 命名abc123
     * 2. 乱抽象，参数传handler，网络请求传context，把业务写到基础框架里
     * 3. activity强引用fragment，全局都是key，到处都可以对个人信息进行写入读取，导致点击某个key引用的代码有几百个，排查起来很是头疼
     * test:
     * 1. 不写测试用例，不用冒烟，当然这是制度的问题，管理层老大
     * 2. 只看现象不看接口，哪一端与预期不符直接找端的负责人，没有上下文
     * 3. 做人问题，自作主张提交测试进度，在哪先看到就是哪一端的问题，汇报的时候不和其他同事商量直接把现有问题向上抛
     * company:
     * 1. 没有公司文化或者说不在乎，几乎没有团建，管理层只关心事情进度，没有人牵头打仗，一旦出现同事互相甩锅
     * keep reason:
     * 辞职两条底线：长期996和拖欠工资
     * 1. 没有长期996，甚至可以用清闲来形容，其他部分的上班一半时间都在摸鱼，有几位待了好几年的同事离职原因是太闲了，再待下去担心废了，想出去找刺激
     * 2. 从未拖欠工资，每月/季度还有一些小福利补贴，虽然都不能和普通的互联网小公司比，但也聊胜于无
     * */

}
