package com.android.notebook.backup.java.server

class Main {

    /**
     * Java服务端技术栈简介
     *
     * 一、单机顶不住，我们就多找点服务器，但是怎么将流量均匀的打到这些服务器上呢？
     * 答：负载均衡，LVS
     *
     * 二、我们机器都是IP访问的，但是我们上网都是访问域名就好了，那怎么通过我们申请的域名去请求到服务器呢？
     * 答：DNS
     *
     * 三、大家刷的抖音，B站，快手等等视频服务商，是怎么保证同时为全国的用户提供快速的体验？
     * 答：CDN
     *
     * 四、我们这么多系统和服务，还有这么多中间件的调度怎么去管理调度等等？
     * 答：zookeeper
     *
     * 五、这么多的服务器，怎么对外统一访问呢，就可能需要知道反向代理的服务器。
     * 答：Nginx
     *
     * 参考:https://www.cnblogs.com/aobing/p/13600092.html
     * */

}